//=============================================================================
//
// アップル処理ヘッダー [Apple.h]
// Author : 
//
//=============================================================================
#ifndef _APPLE_H_
#define _APPLE_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
// アップルの最大数		
#define Apple_Max						(35) 

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
// アップル構造体
typedef struct	
{
	VERTEX_2D			vertexwk[Num_Vertex];		// 頂点情報格納ワーク
	D3DXVECTOR3			pos;						// 座標
	float				HitRadius;					// 当たり半径
	bool				Use;						// 使用フラグ
}APPLE;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitApple(bool FirstInit);
void UninitApple(void);
void UpdateApple(void);
void DrawApple(void);
// アップル取得関数
APPLE *GetApple(int Apple_No);


#endif
