//=============================================================================
//
// ボス弾幕ヘッダー [BossBarrage.h]
// Author：HAL東京　ゲーム学科1年生　頼凱興 
//
//=============================================================================
#ifndef _BOSSBARRAGE_H_
#define _BOSSBARRAGE_H_


//*****************************************************************************
// マクロ定義
//*****************************************************************************

// グローバルマクロ定義
enum BarrageMode
{
	BarrageMode1,	// 円形弾幕
	BarrageMode2,	// ミシャグジさま
	BarrageMode3,	// パーフェクトフリーズ
	BarrageMax,
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// 初期化処理
HRESULT InitBossBarrage(bool FirstInit);
// 終了処理
void UninitBossBarrage(void);
// 更新処理
void UpdateBossBarrage(void);
// 描画処理
void DrawBossBarrage(void);

#endif
