//=============================================================================
//
// 牡牛処理ヘッダー [Bull.h]
// Author： 
//
//=============================================================================
#ifndef _BULL_H_
#define _BULL_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
// 牡牛の最大数		
#define Bull_Max	(2) 


//*****************************************************************************
// 構造体宣言
//*****************************************************************************
typedef struct
{
	VERTEX_2D				vertexwk[Num_Vertex];	// 頂点情報格納ワーク
	D3DXVECTOR3				pos;					// 座標
	D3DXVECTOR3				f_pos;					// 敵とプレィヤーの座標計算
	int						AnimCount;
	int						AnimPattern;
	int						part = 0;				// 敵の状態
	float					move_x = 0.0f;			// Ｘ方向の移動速度
	float					move_y = 0.0f;			// Ｙ方向の移動速度
	float					dealttime = 0.0f;		// 時間計算
	float					move_v0 = 10.0f;		// 始めの速度
	float					move_dash_x = 0.0f;
	float					move_dash_y = 0.0f;
	bool					Use;
	bool					posX;					// プレィヤーの向こう　trueは右　falseは左
}BULL;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBull(bool FirstInit);
void UninitBull(void);
void UpdateBull(void);
void DrawBull(void);
// 牡牛取得関数
BULL *GetBull(int Bull_No);
// 牡牛のテクスチャのサイズを取得する
D3DXVECTOR2 GetBullSize(void);


#endif
