//=============================================================================
//
// 扉処理 [Door.h]
// Author：
//
//=============================================================================
#ifndef _DOOR_H_
#define _DOOR_H_


//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum DoorState
{
	DoorClose,		// 閉まっている
	DoorOpening,	// 開いている
	DoorOpenEnd,	// 開いた
};

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
// 扉構造体
typedef struct
{
	VERTEX_2D		vertexwk[Num_Vertex];	// 頂点情報格納ワーク
	D3DXVECTOR3		pos;					// 座標
	int				AnimCount;				// アニメカウント
	int				AnimPattern;			// アニメパターン
	int				State;					// ドアの状態を記録する変数
	bool			Use;					// 使用フラグ
}DOOR;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitDoor(bool FirstInit);
void UninitDoor(void);
void UpdateDoor(void);
void DrawDoor(void);
// 扉取得関数
DOOR *GetDoor(int Door_No);
// 扉のテクスチャのサイズを取得する
D3DXVECTOR2 GetDoorSize(void);

#endif
