//=============================================================================
//
// エフェクトヘッダー [Effect.h]
// Author：HAL東京　ゲーム学科1年生　頼凱興 
//
//=============================================================================
#ifndef _EFFECT_H_
#define _EFFECT_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************

// グローバルマクロ定義
// エフェクトの種類
enum EffectType
{
	Regenerate,			// リジェネ（HP再生）
	BulletDead,			// ボスの弾の消失
	DeadEffect,			// ボスの死亡エフェクト
	Slash,				// 斬撃
	EffectType_Max,
};


//*****************************************************************************
// 構造体定義
//*****************************************************************************
// エフェクト構造体
typedef struct
{
	VERTEX_2D		vertexwk[Num_Vertex];		// 頂点情報格納ワーク
	D3DXVECTOR3		pos;						// 座標
	D3DXVECTOR3		rot;						// テクスチャの回転角度
	float			Radius;						// 画像中心から頂点までの距離
	float			BaseAngle;					// 画像中心から頂点までの角度
	int				Count;						// カウント
	int				AnimPattern;				// テクスチャの何番分割
	int				Alpha;						// 加算合成、透明合成用アルファ値
	int				Type;						// エフェクトの種類
	int				Owner;						// エフェクトの所有者
	bool			Use;						// 使用フラグ
}EFFECT;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// 初期化処理
HRESULT InitEffect(bool FirstInit);
// 終了処理
void UninitEffect(void);
// 更新処理
void UpdateEffect(void);
// 描画処理
void DrawEffect(void);
// エフェクトの設置
void SetEffect(int Owner, int EffectType, D3DXVECTOR3 Pos);

#endif
