//=============================================================================
//
// 一時停止ヘッダー [Pause.h]
// Author：HAL東京　ゲーム学科1年生　頼凱興 
//
//=============================================================================
#ifndef _PAUSE_H_
#define _PAUSE_H_


//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum PauseSelectState
{
	Select_Resume,
	Select_ToMainMenu,
	Select_ToTitle,
};

//*****************************************************************************
// 構造体定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// 初期化処理
HRESULT InitPause(bool FirstInit);
// 終了処理
void UninitPause(void);
// 更新処理
void UpdatePause(void);
// 描画処理
void DrawPause(void);
// 一時停止状態を設置
void SetPauseFlag(bool Flag);
// 一時停止フラグを取得
bool GetPauseFlag(void);
// 選択状態を取得
int GetPauseSelect(void);


#endif
