//=============================================================================
//
// スコア処理ヘッダー [Score.h]
// Author：HAL東京　ゲーム学科1年生　頼凱興 
//
//=============================================================================
#ifndef _SCORE_H_
#define _SCORE_H_

//*****************************************************************************
// 構造体定義
//*****************************************************************************
// スコア構造体
typedef struct
{
	VERTEX_2D				vertexwk[Num_Vertex];	// 頂点情報格納ワーク
	D3DXVECTOR3				pos;					// 座標
	int						Number;					// 表示する数字
}SCORE;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitScore(bool FirstInit);
void UninitScore(void);
void UpdateScore(void);
void DrawScore(void);
// スコアを加算する
void AddScore(int Score);
// スコアを取得
int GetScore(void);
// スコア数字のテクスチャを取得
LPDIRECT3DTEXTURE9 GetNumberTex(void);

#endif
