//=============================================================================
//
// 狼処理ヘッダー [Wolf.h]
// Author：
//
//=============================================================================
#ifndef _WOLF_H_
#define _WOLF_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
// 狼の最大数		
#define Wolf_Max						(20) 

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
// 狼構造体
typedef struct
{
	VERTEX_2D			vertexwk[Num_Vertex];		// 頂点情報格納ワーク
	D3DXVECTOR3			pos;						// 座標
	float				HitRadius;					// 当たり半径
	int					AnimCount;						// アニメカウント
	int					AnimPattern;				// アニメパターン
	int					Direction;					// 方向
	bool				Use;						// 使用フラグ
}WOLF;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitWolf(bool FirstInit);
void UninitWolf(void);
void UpdateWolf(void);
void DrawWolf(void);
// 狼取得関数
WOLF *GetWolf(int Wolf_No);
// 狼のテクスチャのサイズを取得する
D3DXVECTOR2 GetWolfSize(void);

#endif
